# Вывести 17 элемент из списка
primes = [2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71]

print(primes[16]) # Индекс элемента равно его порядковый номер - 1

# Вывести последний элемент из списка
primes = [2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71]

print(primes[-1])

# Вывести первые 6 элементов списка
primes = [2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71]

print(primes[:6])

# Вывести сумму минимального и максимального элемента списка
numbers = [12.5, 3.1415, 2.718, 9.8, 1.414, 1.1618, 1.324]

print(min(numbers) + max(numbers))

# Найти среднее арифметическое списка
evens = [2, 4, 6, 8, 10, 12, 14, 16, 18, 20]
average = sum(evens) / len(evens)

print(average)

# Поменять значение элемента Green на Зеленый и
# Поменять значение элемента Violet на Фиолетовый
rainbow = ['Red', 'Orange', 'Yellow', 'Green', 'Blue', 'Indigo', 'Violet']
rainbow[3] = 'Зеленый'
rainbow[6] = 'Фиолетовый'

print(rainbow)

# Вывести элементы в обратном порядке
languages = ['Chinese', 'Spanish', 'English', 'Hindi', 'Arabic', 'Bengali', 'Portuguese', 'Russian', 'Japanese', 'Lahnda']

print(languages[::-1])

# Вывести чтобы список был в таком формате:
# [1, 2, 3, 1, 2, 3, 6, 6, 6, 6, 6, 6, 6, 6, 6, 7, 8, 9, 10, 11, 12, 13]
numbers1 = [1, 2, 3] * 2
numbers2 = [6] * 9
numbers3 = [1, 2, 3] * 2 + [6] * 9 + [7, 8, 9, 10, 11, 12, 13]

print(numbers3)  


