# Вывести первые 12 симоволов в строке
s = "In 2010, someone paid 10k Bitcoin for two pizzas."
print(s[:12])

# Вывести последние 9 символов в строке
s = "In 2010, someone paid 10k Bitcoin for two pizzas."
print(s[-9:])

# Вывести каждый 7-й символ начиная с нуля 
s = "In 2010, someone paid 10k Bitcoin for two pizzas."
print(s[0::7])

# 
s = input()
print(len(s)) # Выводит общее кол-во символов в строке
for i in range(3):
    print(s[:], end='')  # Исходная строка, повторенная 3 раза 
    
print()    
print(s[0]) # Выводит первый символ строки
print(s[:3]) # Выводит 3 певых символа строки
print(s[-3:]) # Выводит 3 последних символа строки
print(s[::-1]) # Выводит строку в обратном порядке
print(s[1:-1]) # Выводит строку без первого и последнего символа

#
s = input()

print(s[2]) # третий символ этой строки;
print(s[-2]) # предпоследний символ этой строки;
print(s[:5]) # первые пять символов этой строки;
print(s[:-2]) # всю строку, кроме последних двух символов;
print(s[::2]) # все символы с чётными индексами;
print(s[1::2]) # все символы с нечётными индексами;
print(s[::-1]) # все символы в обратном порядке;
print(s[::-2]) # все символы строки через один в обратном порядке, начиная с последнего.

# Разделяет строку на две равные части и переставляет их местами
s = input()

mid = (len(s) + 1) // 2

first_half = s[:mid]
second_half = s[mid:]

print(second_half + first_half)












